docs/pages/emacs.html
<!DOCTYPE html>
<html lang="es">
<head>
<!-- 2021-03-25 jue 11:35 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>EMACS </title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="./css/style.css" type="text/css"/>
<link rel="stylesheet" href="./css/org.css" type="text/css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">EMACS </h1>
</header><nav id="table-of-contents">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org00da22b">Emacs</a></li>
<li><a href="#org0baf09f">Caracteres unicode y ubuntu 20.04</a></li>
<li><a href="#orgcd6af15">Ejemplos de como añadir enlaces a otros ficheros org</a></li>
</ul>
</div>
</nav>
<div id="outline-container-sitemap" class="outline-2 sitemap">
<h2 id="sitemap">Sitemap</h2>
<div class="outline-text-2" id="text-sitemap">
<ul class="org-ul">
<li><a href="index.html">Página principal</a></li>
<li><a href="acerca-de.html">Acerca de</a></li>
<li><a href="emacs.html">EMACS</a></li>
</ul>
</div>

<div id="outline-container-orgebf6873" class="outline-3">
<h3 id="orgebf6873">Volver al inicio</h3>
<div class="outline-text-3" id="text-orgebf6873">
<p>
<a href="/index.html">Página Principal</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org00da22b" class="outline-2">
<h2 id="org00da22b">Emacs</h2>
<div class="outline-text-2" id="text-org00da22b">
<p>
Esta página contiene información de configuraciones de emacs.
</p>
</div>
</div>

<div id="outline-container-org0baf09f" class="outline-2">
<h2 id="org0baf09f">Caracteres unicode y ubuntu 20.04</h2>
<div class="outline-text-2" id="text-org0baf09f">
<p>
Para que se vean los caracteres especiales en ubuntu hay que instalar el paquete
<code>ttf-ancient-fonts</code> que también nos intalara <code>fonts-ancient-scripts
fonts-symbola</code>, esto funciona junto a alguna capa de spacemacs
</p>
</div>
</div>

<div id="outline-container-orgcd6af15" class="outline-2">
<h2 id="orgcd6af15">Ejemplos de como añadir enlaces a otros ficheros org</h2>
<div class="outline-text-2" id="text-orgcd6af15">
<ul class="org-ul">
<li>Enlace a una cabecera de otro documento <a href="acerca-de.html#sitemap">Sitemap</a>
<code>[[file:acerca-de.org::*Sitemap][Sitemap]]</code></li>
<li><code>[[file:foo.org::#custom-id]]</code></li>
<li><code>[[file:foo.org::target]]</code></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-03-25 jue 11:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
